Revit 2024 API
SketchPlane.GetPlane Method
 Returns the corresponding Plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Plane GetPlane()
Visual Basic
Public Function GetPlane As Plane
Visual C++
public:
Plane^ GetPlane()
Return Value
 The plane upon which elements created with this sketch plane will lie.
See Also
SketchPlane Class
Autodesk.Revit.DB Namespace